[
  {
    "id": "harry_potter",
    "name": "Гарри Поттер",
    "rating": 5000,
    "preview": "Harry Potter is a series of fantasy novels written by British author J. K. Rowling. The novels chronicle the life of a young wizard, Harry Potter, and his friends Hermione Granger and Ron Weasley, all of whom are students at Hogwarts School of Witchcraft and Wizardry."
  },
  {
    "id": "gone_with_the_wind",
    "name": "Унесенные ветром",
    "rating": 500,
    "preview": "роман американской писательницы Маргарет Митчелл, события которого происходят в южных штатах США в 1860-х годах, во время (и после) гражданской войны."
  },
  {
    "id": "le_comte_de_monte-cristo",
    "name": "Граф Монте-Кристо",
    "rating": 600,
    "preview": "приключенческий роман Александра Дюма, классика французской литературы, написанный в 1844—45 годах. Имя своему герою писатель придумал во время путешествия по Средиземному морю, когда он увидел остров Монтекристо и услышал легенду о зарытых там несметных сокровищах."
  },
  {
    "id": "the_green_mile",
    "name": "Зелёная миля",
    "rating": 800,
    "preview": "роман Стивена Кинга. В 1999 году по роману был снят одноимённый фильм."
  },
  {
    "id": "the_godfather",
    "name": "Крёстный отец",
    "rating": 800,
    "preview": "роман Марио Пьюзо, изданный в 1969 году и рассказывающий о жизни одного из могущественных мафиозных кланов Америки — семье дона Корлеоне. На русском языке впервые опубликован в журнале «Знамя» (1987, № 10, 11, 12; перевод Марии Кан и Александры Ильф)."
  },
  {
    "id": "guards_guards",
    "name": "Стража! Стража!",
    "rating": 400,
    "preview": "юмористическое фэнтези английского писателя Терри Пратчетта, написано в 1989 году."
  },
  {
    "id": "wyrd_sisters",
    "name": "Вещие сестрички",
    "rating": 200,
    "preview": "юмористическое фэнтези английского писателя Терри Пратчетта, написано в 1988 году."
  },
  {
    "id": "men_at_arms",
    "name": "К оружию! К оружию!",
    "rating": 700,
    "preview": "юмористическое фэнтези английского писателя Терри Пратчетта, написано в 1993 году."
  },
  {
    "id": "master_i_margarita",
    "name": "Мастер и Маргарита",
    "rating": 600,
    "preview": "роман Михаила Афанасьевича Булгакова, работа над которым началась в конце 1920-х годов и продолжалась вплоть до смерти писателя. Роман относится к незавершённым произведениям; редактирование и сведение воедино черновых записей осуществляла после смерти мужа вдова писателя — Елена Сергеевна."
  },
  {
    "id": "prestuplenie_i_nakazanie",
    "name": "Преступление и наказание",
    "rating": 800,
    "preview": "социально-психологический и социально-философский роман Фёдора Михайловича Достоевского, над которым писатель работал в 1865—1866 годах. Впервые опубликован в 1866 году в журнале «Русский вестник» (№ 1, 2, 4, 6—8, 11, 12)"
  },
  {
    "id": "le_petit_prince",
    "name": "Маленький принц",
    "rating": 900,
    "preview": "аллегорическая повесть, наиболее известное произведение Антуана де Сент-Экзюпери."
  }
]